---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentError
source: html/1d58b4ff-59e8-d628-7cca-171e1201a274.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentError Property

The solution is failing to do segments which are zero length.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZeroLengthSegmentError { get; }
```